#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_job.glue_job will be created
  + resource "aws_glue_job" "glue_job" {
      + arn          = (known after apply)
      + description  = "This is script to convert dataset"
      + glue_version = "4.0"
      + id           = (known after apply)
      + max_capacity = (known after apply)
      + max_retries  = 1
      + name         = "group2"
      + role_arn     = "arn:aws:iam::684710758112:role/LabRole"
      + tags_all     = (known after apply)
      + timeout      = 2880

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://terraform-nikhil-prac/test.py"
        }

      + execution_property {
          + max_concurrent_runs = 2
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Nikhilpatil333, Action: `pull_request`*